using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ConsoleHome
{
    internal class Program
    {
        
        static void Main(string[] args)
        {
            Position position = new Position();

            //tradeDirection t = tradeDirection.Long;
            //Console.WriteLine(t);
            Console.ReadKey();

        }
        
        
    }
}


// Задание:
// Сделать Enum для класса Trade
// В класс Position добавить поля или свойства которые будут описывать позицию -
// например количество открытых лотов цена открытия cделки и еще все что нужно 
// какой интсрумент и т д = все поля додумать
//
// Методы который получает новую сделку - нужно считать новую позицию
//